<template>
  <div class="recharge-agreement">
    <van-nav-bar left-arrow title="充值协议" @click-left="goBack" />
    <div class="content">
      <div class="main">
        <h4>尊敬的用户，您好。</h4>
        <p>
          在同意 《世界波用户充值协议》（下称：本协议）前，请您认真阅读并充分知悉、理解世界波平台的各项规则及要求（包括但不限于《世界波用户服务协议》、《世界波隐私政策》），以及国家关于互联网信息服务的有关法律法规等。如果您对本协议的任何条款表示异议，您可以选择不使用世界波平台中账户充值相关的所有功能；您的
          使用则意味着您同意遵守本协议下全部内容，以及我们后续对本协议随时所作的任何修改。
          本协议已对与您的权益有或可能具有重大关系的条款，及对世界波平台具有或可能具有免责或限制责任的条款用粗体字予以标注，请您注意。
        </p>
        <p>
          请确认您具有完全民事行为能力，如您已年满18周岁，或您已年满16周岁且依靠自己的劳动收入作为主要生活来源，否则请您停止使用本协议项下与账户充值相关的所有功能。
        </p>
        <h4>第一章 总则</h4>
        <p>
          第1条
          世界波平台是成都球探科技有限公司世界波团队(下称：球探科技)推出的一个更方便的进行赛事资讯、赛事观看（动画）、赛事交流、赛事分析等服务并与用户进行互动的赛事社交互动平台。世界波平台将为用户提供虚拟产品、用户社区、数据支持、技术支持等赛事相关互动社交所需的服务。
        </p>
        <p>第2条 世界波平台所有权、经营权、管理权均属球探科技。</p>
        <p>第3条 本协议最终解释权归属球探科技。</p>
        <h4>第二章 虚拟产品购买规则</h4>
        <p>
          第4条
          “球币”是世界波平台向您提供的用于在世界波平台上进行相关消费的虚拟产品，您可以用“球币”在世界波平台上购买和体验各项付费服务。
          “雷速会员、雷速年费会员”是世界波为您打造的增值产品，适用于社区发帖、聊天室聊天、用户签到、资讯阅读、个人资料修改等多个用户使用场景。
          您所充值后获得的“球币、雷速会员、雷速年费会员”不能兑换为人民币，您应根据自己的实际需求购买相应类型、数量或时长的虚拟产品。世界波各平台中虚拟产品的充值价格详见附件一
        </p>
        <p>
          第5条
          您暂时只能用PC端网页或移动端应用（世界波APP），通过支付宝、苹果支付等第三方支付平台，以人民币充值并购买虚拟产品。
        </p>
        <p>
          第6条
          世界波平台保留根据相关法律规定、主管部门要求、业务开展情况等因素对使用人民币购买虚拟产品的规则进行单方面变更、调整、中止或终止的权利。您同意无条件接受对上述购买规则的变更、调整、中止或终止，
          世界波平台开展前述行动时将以于世界波平台公布的方式通知，并自公布之日起自动生效，而无需另行单独通知您，也不就该等行动给您造成的任何损失承担任何责任。
        </p>
        <p>
          第7条
          在使用充值方式时，您务必仔细确认自己的世界波账号并仔细选择您需要充值购买的虚拟产品数量、时长和类型。
          若因为您自身登录错误的账号、操作不当或不了解充值计费方式等因素造成充错账号、错选充值类型等情形而损害自身权益的，世界波平台将不会作出任何补偿、赔偿或退款。
        </p>
        <p>
          第8条
          若您以非法的方式，或使用非世界波平台所指定的充值方式进行虚拟产品的购买，世界波平台不保证该充值流程顺利或者正确完成。
          若因此造成您权益受损，世界波平台不会作出任何补偿、赔偿或退款，世界波平台同时保留随时冻结或终止您世界波账号资格及使用各项充值服务的权利。
        </p>
        <p>
          第9条
          充值成功后，充值所增加的账号内虚拟产品可由您在世界波平台上自由使用，但世界波平台不会提供任何退还或逆向兑换服务。
        </p>
        <p>
          第10条
          如果世界波平台发现因系统故障或其他任何原因导致的处理错误，无论有利于世界波平台还是有利于您，世界波平台都有权在以电子邮件、微信或其他合理方式通知您后纠正该错误。如果该措施导致您实际收到的虚拟产品的数量或时长少于您应获得的“虚拟产品，则世界波平台在确认该处理错误后会尽快将差额补足至您的世界波账户中。如果该错误导致您实际收到的虚拟产品的数量或时长多于您应获得的虚拟产品，则无论错误的性质和原因如何，世界波平台有权从您的世界波账户中直接扣除差额。
        </p>
        <h4>第三章 权利声明</h4>
        <p>
          第11条
          您可随时登录世界波平台查看您的虚拟资产的剩余金额或剩余时长情况。如您对该记录有异议，应立即向世界波平台提出，世界波平台核对后确有错误的，将予以更正；否则您同意世界波平台上的交易记录将作为世界波平台虚拟产品交易的唯一有效依据。
        </p>
        <p>
          第12条
          世界波平台有权基于交易安全等方面的考虑不时设定涉及交易的相关事项，包括但不限于交易限额、交易次数等。您了解，世界波平台的前述设定可能对您的交易造成一定不便，您对此没有异议。
        </p>
        <p>
          第13条
          在任何情况下，对于您购买虚拟产品时涉及由第三方提供相关服务的责任由该第三方承担，世界波平台不承担该等责任。
        </p>
        <p>
          第14条
          进行充值时，您应确保您是绑定的支付宝、苹果支付等第三方支付账户的持有人，可合法、有效使用该账户且未侵犯任何第三方合法权益，否则
          因此造成支付宝、苹果支付等第三方支付账户实际所有人损失的，您应单独负责解决由此产生的纠纷并承担全部法律责任。
        </p>
        <p>
          第15条
          因您自身的原因导致世界波平台无法提供世界波平台虚拟产品购买服务或提供虚拟产品购买服务时发生任何错误而产生的任何损失或责任，由您自行负责，世界波平台不承担责任，
          包括但不限于：
        </p>
        <p>
          （1）您未按照本协议或世界波平台不时公布的任何规则进行操作；
        </p>
        <p>（2）因您的世界波账号失效、丢失、被封停；</p>
        <p>（3）因您绑定的第三方支付机构账户的原因导致的损失或责任，包括您使用未经认证的第三方支付账户或使用非您本人的第三方支付账户，您的第三方支付账户被冻结、查封等； </p>
        <p>（4）您将密码告知他人导致的财产损失；</p>
        <p>（5）因您个人的故意或重大过失所造成的财产损失。</p>
        <p>
          第16条
          世界波平台系统因下列状况无法正常运作，使您无法使用各项服务或任何虚拟财产丢失时，球探科技不承担损害赔偿责任，
          该状况包括但不限于：
        </p>
        <p>（1）在世界波平台公告之系统停机维护、升级、调整期间；</p>
        <p>（2）电信通讯或设备出现故障不能进行数据传输的；</p>
        <p>（3）因台风、地震、海啸、洪水、停电、战争、恐怖袭击、政府管制等不可抗力之因素，造成世界波平台系统障碍不能执行业务的；</p>
        <p>（4）由于黑客攻击、电信部门技术调整或故障、网站升级、相关第三方的问题等原因而造成的服务中断或者延迟。</p>
        <h4>第四章 处罚规则</h4>
        <p>
          第17条
          如发生下列任何一种情形，世界波平台有权随时中断或终止向您提供本协议项下的网络服务而无需通知您：
        </p>
        <p>(1) 您提供的个人资料不真实；</p>
        <p>（2）您违反本协议中规定的购买规则。</p>
        <p>
          除前款所述情形外，世界波平台同时保留在不事先通知您的情况下随时中断或终止部分或全部网络充值服务的权利，对于充值服务的中断或终止而造成的任何损失，世界波平台无需对您或任何第三方承担任何责任。
        </p>
        <p>
          第18条
          如果用户通过其它非世界波平台认可的渠道非法购买球币，则世界波平台有权冻结该账户，并进行相应惩罚，严重者可以进行封号处理。
        </p>
        <p>
          第19条
          用户在使用世界波平台时，如出现违反国家法律法规、《世界波用户服务协议》约定、本协议约定或其他世界波平台对用户的管理规定的情形，世界波平台有权暂时或永久封禁您的账号。账号封禁后至解禁（如有）前，您不可继续使用您在平台上已经充值购买的虚拟产品或服务，同时世界波不予返还您购买相关虚拟产品或服务时的现金价值。
        </p>
        <h4>第五章 附则</h4>
        <p>
          第20条
          世界波平台保留修改或增补本协议内容的权利。本协议的修改文本将公告于世界波平台或以其他世界波平台认为可行的方式公告。修改文本一旦公布则立即生效，且对生效前的用户同样适用。若您在本协议内容发生修订后，继续使用本服务的，则视为您同意最新修订的协议内容；否则您须立即停止使用本服务。
        </p>
        <p>
          第21条
          因本协议引起的或与本协议有关的争议，均适用中华人民共和国法律。
        </p>
        <p>
          第22条
          因本协议引起的或与本协议有关的争议，世界波平台与您将协商解决。协商不成的，任何一方均有权向球探科技所在地有管辖权的法院提起诉讼。
        </p>
        <p>
          第23条
          本协议部分内容被有管辖权的法院认定为违法或无效的，不因此影响其他内容的效力。
        </p>
        <p>
          第24条
          本协议未涉及的问题参见国家有关法律法规，当本协议与国家法律法规冲突时，以国家法律法规为准。
        </p>
        <p>
          第25条
          本协议项下所有的通知均可通过重要页面公告、电子邮件或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。
        </p>
        <p>第26条 本协议签订地：成都市【高新】区。</p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  methods: {
    goBack() {
      this.$router.back(-1)
    }
  }
}
</script>

<style lang="scss" scoped>
.recharge-agreement {
  background: #F5F5F5;
  .content {
   height: calc(100vh - 44px);
   .main{
     height: 100%;
     overflow-x: hidden;
     overflow-y: auto;
     padding: 0 10px;
     h4{
       font-size: 16px;
       color: #333;
       margin: 14px;
     }
      p {
      font-size: 14px;
      text-align: justify;
      line-height: 24px;
      color:#666;
      margin: 14px 0 14px 0;
    }
   }

  }
}
</style>
